src/Documents/ДвижениеМПЗ/ДвижениеМПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМПЗ</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗПрочее</basedOn>
  <basedOn>Document.ВыпускПродукцииКанбан</basedOn>
  <basedOn>Document.МаршрутнаяКарта</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ПоступлениеИзПереработки</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.Долги</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияВ</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСборке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/БарКоды/БарКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БарКоды</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйБарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>MAC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IMEI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодDanfoss</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомерEnLogic</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>IDКлюча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>BT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Перепрогон/Перепрогон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перепрогон</name>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписания</name>
    <type>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяСписания</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НумераторБарКодов/НумераторБарКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НумераторБарКодов</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СледующийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСброса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ДвижениеМПЗ/Forms/ФормаПерепрогона/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого ТЧ Из Параметры.Документ.ТабличнаяЧасть Цикл
		Если (СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование) = "шт") или
			 (СокрЛП(ТЧ.ЕдиницаИзмерения.Наименование) = "упак") Тогда
			Для к = 1 По ТЧ.Количество Цикл
			ТЧ_Т = ТаблицаИзделий.Добавить();
			ТЧ_Т.Изделие = ТЧ.МПЗ;
			ТЧ_Т.Количество = 1;
			ТЧ_Т.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;
			КонецЦикла;
		Иначе 
		ТЧ_Т = ТаблицаИзделий.Добавить();
		ТЧ_Т.Изделие = ТЧ.МПЗ;
		ТЧ_Т.Количество = ТЧ.Количество;
		ТЧ_Т.ЕдиницаИзмерения = ТЧ.ЕдиницаИзмерения;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
ОписаниеОшибки = "";
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
   Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
      ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
      ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , ОписаниеОшибки);
      Сообщить(ТекстСообщения);
   КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
ПоддерживаемыеТипыВО = Новый Массив();
ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
КонецПроцедуры

&НаСервере
Функция КнопкаСоздатьНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	НомСтр = 0;	
		Для каждого ТЧ Из ТаблицаИзделий Цикл
			Если ТипЗнч(ТЧ.Изделие) = Тип("СправочникСсылка.Номенклатура") Тогда
			Подразделение = ТЧ.Изделие.Линейка.Подразделение;
			Иначе	
			Подразделение = Константы.МестоХраненияГПТНП.Получить().Подразделение;
			КонецЕсли; 
		Н = Справочники.НумераторБарКодов.НайтиПоРеквизиту("Подразделение",Подразделение);
			Если Не Н.Пустая() Тогда
				Если КонецДня(Н.ДатаСброса) < КонецДня(ТекущаяДата()) Тогда
				Нумератор = Н.ПолучитьОбъект();
				Нумератор.СледующийНомер = 1;
				Нумератор.ДатаСброса = КонецГода(ТекущаяДата());
				Нумератор.Записать();					
				КонецЕсли;
			Иначе
			Сообщить(СокрЛП(Подразделение.Наименование)+" - не создан нумератор бар-кодов для подразделения!");
			ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
			Возврат(Ложь);
			КонецЕсли;
		НомСтр = НомСтр + 1;	
		Перепрогон = Документы.Перепрогон.СоздатьДокумент();
		Перепрогон.Автор = ПараметрыСеанса.Пользователь;
		Перепрогон.ДокументОснование = Параметры.Документ;
		Перепрогон.Дата = ТекущаяДата();
		Перепрогон.Номер = Параметры.Документ.Номер+"-"+Формат(НомСтр,"ЧЦ=2; ЧВН=");
		Перепрогон.Подразделение = Подразделение;
		Перепрогон.Статус = 2;
		Перепрогон.Изделие = ТЧ.Изделие;
		Перепрогон.Количество = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Перепрогон.Записать(РежимЗаписиДокумента.Запись);
		БарКод = РегистрыСведений.БарКоды.СоздатьМенеджерЗаписи();
		БарКод.Период = ТекущаяДата();
		БарКод.ПЗ = Перепрогон.Ссылка;
		БарКод.Изделие = ТЧ.Изделие;
		БарКод.Товар = ТЧ.Изделие.Товар;
			Если ТЧ.НовыйБарКод Тогда			
			БарКод.БарКод = ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(ТЧ.Изделие.Товар.Код)+Сред(Год(ТекущаяДата()),4)+Формат(Месяц(ТекущаяДата()),"ЧЦ=2; ЧВН=")+Подразделение.Код+Формат(Н.СледующийНомер,"ЧЦ=6; ЧВН=; ЧГ=");	
			Нумератор = Н.ПолучитьОбъект();
			Нумератор.СледующийНомер = Нумератор.СледующийНомер+1;
			Нумератор.Записать();				
			Иначе
			БарКод.БарКод = ТЧ.СтарыйБарКод;
			КонецЕсли;
		БарКод.СтарыйБарКод = ТЧ.СтарыйБарКод;
		БарКод.Записать();
		КонецЦикла;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина);
КонецФункции

&НаСервере
Функция ЭтоТовар(Изделие)
Возврат(ЗначениеЗаполнено(Изделие.Товар));
КонецФункции 

&НаКлиенте
Процедура КнопкаСоздать(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл	
		Если Не ЗначениеЗаполнено(ТЧ.СтарыйБарКод) Тогда	
		Сообщить("Не все старые бар-коды введены!");
		Возврат;
		КонецЕсли; 
			Если Не ЭтоТовар(ТЧ.Изделие) Тогда
			Сообщить(""+СокрЛП(ТЧ.Изделие)+" - не привязано к товару!");
			Возврат;
			КонецЕсли;
				Если СтрДлина(СокрЛП(ТЧ.СтарыйБарКод)) = 17 Тогда
					Если Не ПроверитьКодТовара(ТЧ.Изделие,Лев(ТЧ.СтарыйБарКод,5)) Тогда
					Сообщить(""+СокрЛП(ТЧ.Изделие)+" - код товара не совпадает с кодом товара в бар-коде!");
					Возврат;
					КонецЕсли;					
				Иначе	
					Если Не ПроверитьКодТовара(ТЧ.Изделие,Лев(ТЧ.СтарыйБарКод,6)) Тогда
					Сообщить(""+СокрЛП(ТЧ.Изделие)+" - код товара не совпадает с кодом товара в бар-коде!");
					Возврат;
					КонецЕсли;					
				КонецЕсли;  
	КонецЦикла; 
		Если КнопкаСоздатьНаСервере() Тогда
		ЭтаФорма.Закрыть();
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция ПроверитьКодТовара(Изделие,Код)
	Если ОбщийМодульВызовСервера.ПолучитьАртикулПоКодуТовара(Изделие.Товар.Код) = Код Тогда
	Возврат(Истина);	
	Иначе	
	Возврат(Ложь);
	КонецЕсли; 
КонецФункции 

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если СтрДлина(СокрЛП(Данные)) = 17 Тогда
		Если ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Данные,5)) Тогда
		Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод = Данные;
		Иначе	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	Иначе
		Если ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Данные,6)) Тогда
		Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод = Данные;
		Иначе	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИзделийСтарыйБарКодПриИзменении(Элемент)
	Если СтрДлина(СокрЛП(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод)) = 17 Тогда
		Если Не ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод,5)) Тогда	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	Иначе
		Если Не ПроверитьКодТовара(Элементы.ТаблицаИзделий.ТекущиеДанные.Изделие,Лев(Элементы.ТаблицаИзделий.ТекущиеДанные.СтарыйБарКод,6)) Тогда	
		Сообщить("Код товара не совпадает с кодом товара в бар-коде!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	ТЧ.НовыйБарКод = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	ТЧ.НовыйБарКод = Ложь;
	КонецЦикла;
КонецПроцедуры
